In [44]:
import pandas as pd
import csv
import datetime as dt
import pymongo
from sqlalchemy import create_engine
from config import username, password

# Extraction

In [45]:
# Extracted two data sources:
us = pd.read_csv('us-counties.csv')
tax_data = pd.read_csv('2014_irs_tax_returns.csv')
us_counties = pd.read_csv('us_counties_covid19_daily.csv')
states = pd.read_csv('states.csv')

In [46]:
states.head()

        State  Abbrev Code
0     Alabama    Ala.   AL
1      Alaska  Alaska   AK
2     Arizona   Ariz.   AZ
3    Arkansas    Ark.   AR
4  California  Calif.   CA

# Transform

### First Dataset

In [47]:
tax_data.head()

,statefips,state,zipcode,agi_stub,n1,mars1,mars2,mars4,prep,n2,...,a10300,n85530,a85530,n85300,a85300,n11901,a11901,n11902,a11902,year
0,1,AL,0,1,850050,481840,115070,240450,479900,1401930,...,324575,0,0,0,0,62690,47433,744910,1964826,2014
1,1,AL,0,2,491370,200750,150290,125560,281350,1016010,...,950446,0,0,0,0,70780,101969,413790,1177400,2014
2,1,AL,0,3,259540,75820,142970,34070,156720,589190,...,1319641,0,0,0,0,62170,132373,192050,538160,2014
3,1,AL,0,4,164840,26730,125410,10390,99750,423300,...,1394913,0,0,0,0,45120,124048,115470,375882,2014
4,1,AL,0,5,203650,18990,177070,5860,122670,565930,...,3655700,610,135,270,66,81180,387298,114380,448442,2014

In [48]:
taxes = tax_data.drop(columns=['n1','mars1','mars2','mars4','prep','n2','a10300','n85530','a85530']).dropna()

In [49]:
tax = taxes.drop(columns = ['numdep','total_vita','vita','tce','n06500','a06500','n10300','n85300','a85300','a00200','n00300','a00300',
                           'n00600','a00600','n00650','a00650','n00700','a11070','n10960','n11560','a00700','n00900','a00900','n01000','n59720',
                           'a59720','n11070','a10960','a11560','n11901','a11901','n01400','a01400','n01700','a85775','n09750','a09750','n10600',
                           'a01700','schf','n02300','a02300','n02500','a09400','n85770','n85775','a10600','n59660','a59660','n11902','a11902',
                           'a02500','n26270','a26270','a07230','n07240','a07240','n07220','a07220','n07260','a07260','n09400','a85770','n02900',
                           'a02900','n03220','n05780','a05780','a05780','n07100','a07100','n07300','a07300','n07180','n07230','a03220','n03300',
                           'n19700','a19700','n04800','a04800','n05800','n09600','a09600','a07180','a03300','n03270','a03270','n18450','a18450',
                           'n18500','a18500','n18300','a18300','n19300','a19300','a05800','n03150','a03150','n03210','n03230','a03230','n03240',
                           'a03240','n04470','a04470','a00101','n18425','a18425','a03210','a01000','n02650','n00200','a02650','agi_stub',
                           'statefips','zipcode'])

In [51]:
tax.head()

  state    a00100  year
0    AL  11004990  2014
1    AL  17658446  2014
2    AL  15963943  2014
3    AL  14294375  2014
4    AL  27387096  2014

In [52]:
tax1 = tax.rename(columns={"state": "Code","a00100":"AGI"})

In [53]:
tax1.head()

  Code       AGI  year
0   AL  11004990  2014
1   AL  17658446  2014
2   AL  15963943  2014
3   AL  14294375  2014
4   AL  27387096  2014

In [54]:
tax_df = tax1.groupby(['Code'])
AGI = tax_df[["AGI"]].sum()
#income_df = tax1.groupby(['Code'])

In [55]:
AGI.head()

             AGI
Code
AK      48753590
AL     217923266
AR     130888556
AZ     333873862
CA    2628777328

### Second Dataset

In [56]:
us_counties.state.count()

179696

In [57]:
us_counties.head(5000)

            date        county         state     fips  cases  deaths
0     2020-01-21     Snohomish    Washington  53061.0      1       0
1     2020-01-22     Snohomish    Washington  53061.0      1       0
2     2020-01-23     Snohomish    Washington  53061.0      1       0
3     2020-01-24          Cook      Illinois  17031.0      1       0
4     2020-01-24     Snohomish    Washington  53061.0      1       0
...          ...           ...           ...      ...    ...     ...
4995  2020-03-19         Wayne  Pennsylvania  42127.0      1       0
4996  2020-03-19  Westmoreland  Pennsylvania  42129.0      2       0
4997  2020-03-19          York  Pennsylvania  42133.0      2       0
4998  2020-03-19       Unknown   Puerto Rico      NaN      6       0
4999  2020-03-19       Unknown  Rhode Island      NaN     44       0

[5000 rows x 6 columns]

In [58]:
#counties = us_counties.dropna()

In [59]:
###Convert state names to abbreviations

In [60]:
counties1 = us_counties.rename(columns={"state": "State"})

In [61]:
counties_states = pd.merge(counties1, states, on = 'State')

In [62]:
covid = counties_states.drop(columns = ['fips','Abbrev','State'])

In [71]:
covid.head()

         date     county  cases  deaths Code
0  2020-01-21  Snohomish      1       0   WA
1  2020-01-22  Snohomish      1       0   WA
2  2020-01-23  Snohomish      1       0   WA
3  2020-01-24  Snohomish      1       0   WA
4  2020-01-25  Snohomish      1       0   WA

In [72]:
covid_summary_df = covid.groupby(['Code'])["cases","deaths"].sum()
covid_summary_df.head()

        cases  deaths
Code
AK      19145     384
AL     418550   15492
AR     174291    3556
AZ     459962   20415
CA    2861370  110062

In [73]:
covid_summary_df = covid_summary_df.merge(AGI, left_index=True, right_index=True)

In [74]:
covid_summary_df.head()

        cases  deaths         AGI
Code
AK      19145     384    48753590
AL     418550   15492   217923266
AR     174291    3556   130888556
AZ     459962   20415   333873862
CA    2861370  110062  2628777328

# LOADING

### PostGresSQL Database

In [75]:
db = create_engine(f'postgresql://{username}:{password}@localhost:5432/Covid_db')

In [76]:
db.table_names()

['Covid_summary', 'Covid and AGI']

In [77]:
covid_summary_df.to_sql('Covid_summary', con=db, if_exists='replace')